{"config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "data_format": "channels_first", "bias_constraint": null, "filters": 32, "dtype": "float32", "name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 28, 28], "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [5, 5], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_first", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "units": 128, "name": "dense_1", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "units": 10, "name": "dense_2", "bias_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.3", "backend": "theano"}